results/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: -
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m45s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 1m15s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 002/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 002/100 VUs  0m00.9s/1m15.0s

running (0m01.9s), 003/100 VUs, 2 complete and 0 interrupted iterations
default   [   3% ] 003/100 VUs  0m01.9s/1m15.0s

running (0m02.9s), 004/100 VUs, 5 complete and 0 interrupted iterations
default   [   4% ] 004/100 VUs  0m02.9s/1m15.0s

running (0m03.9s), 005/100 VUs, 9 complete and 0 interrupted iterations
default   [   5% ] 005/100 VUs  0m03.9s/1m15.0s

running (0m04.9s), 007/100 VUs, 14 complete and 0 interrupted iterations
default   [   7% ] 007/100 VUs  0m04.9s/1m15.0s

running (0m05.9s), 008/100 VUs, 21 complete and 0 interrupted iterations
default   [   8% ] 008/100 VUs  0m05.9s/1m15.0s

running (0m06.9s), 009/100 VUs, 29 complete and 0 interrupted iterations
default   [   9% ] 009/100 VUs  0m06.9s/1m15.0s

running (0m07.9s), 011/100 VUs, 38 complete and 0 interrupted iterations
default   [  11% ] 011/100 VUs  0m07.9s/1m15.0s

running (0m08.9s), 012/100 VUs, 49 complete and 0 interrupted iterations
default   [  12% ] 012/100 VUs  0m08.9s/1m15.0s

running (0m09.9s), 013/100 VUs, 61 complete and 0 interrupted iterations
default   [  13% ] 013/100 VUs  0m09.9s/1m15.0s

running (0m10.9s), 014/100 VUs, 72 complete and 0 interrupted iterations
default   [  15% ] 014/100 VUs  0m10.9s/1m15.0s

running (0m11.9s), 016/100 VUs, 86 complete and 0 interrupted iterations
default   [  16% ] 016/100 VUs  0m11.9s/1m15.0s

running (0m12.9s), 017/100 VUs, 102 complete and 0 interrupted iterations
default   [  17% ] 017/100 VUs  0m12.9s/1m15.0s

running (0m13.9s), 018/100 VUs, 119 complete and 0 interrupted iterations
default   [  19% ] 018/100 VUs  0m13.9s/1m15.0s

running (0m14.9s), 019/100 VUs, 137 complete and 0 interrupted iterations
default   [  20% ] 019/100 VUs  0m14.9s/1m15.0s

running (0m15.9s), 020/100 VUs, 156 complete and 0 interrupted iterations
default   [  21% ] 020/100 VUs  0m15.9s/1m15.0s

running (0m16.9s), 021/100 VUs, 176 complete and 0 interrupted iterations
default   [  23% ] 021/100 VUs  0m16.9s/1m15.0s

running (0m17.9s), 022/100 VUs, 197 complete and 0 interrupted iterations
default   [  24% ] 022/100 VUs  0m17.9s/1m15.0s

running (0m18.9s), 023/100 VUs, 218 complete and 0 interrupted iterations
default   [  25% ] 023/100 VUs  0m18.9s/1m15.0s

running (0m19.9s), 024/100 VUs, 240 complete and 0 interrupted iterations
default   [  27% ] 024/100 VUs  0m19.9s/1m15.0s

running (0m20.9s), 025/100 VUs, 264 complete and 0 interrupted iterations
default   [  28% ] 025/100 VUs  0m20.9s/1m15.0s

running (0m21.9s), 026/100 VUs, 289 complete and 0 interrupted iterations
default   [  29% ] 026/100 VUs  0m21.9s/1m15.0s

running (0m22.9s), 027/100 VUs, 315 complete and 0 interrupted iterations
default   [  31% ] 027/100 VUs  0m22.9s/1m15.0s

running (0m23.9s), 028/100 VUs, 342 complete and 0 interrupted iterations
default   [  32% ] 028/100 VUs  0m23.9s/1m15.0s

running (0m24.9s), 029/100 VUs, 370 complete and 0 interrupted iterations
default   [  33% ] 029/100 VUs  0m24.9s/1m15.0s

running (0m25.9s), 030/100 VUs, 399 complete and 0 interrupted iterations
default   [  35% ] 030/100 VUs  0m25.9s/1m15.0s

running (0m26.9s), 031/100 VUs, 429 complete and 0 interrupted iterations
default   [  36% ] 031/100 VUs  0m26.9s/1m15.0s

running (0m27.9s), 032/100 VUs, 458 complete and 0 interrupted iterations
default   [  37% ] 032/100 VUs  0m27.9s/1m15.0s

running (0m28.9s), 033/100 VUs, 490 complete and 0 interrupted iterations
default   [  39% ] 033/100 VUs  0m28.9s/1m15.0s

running (0m29.9s), 034/100 VUs, 523 complete and 0 interrupted iterations
default   [  40% ] 034/100 VUs  0m29.9s/1m15.0s

running (0m30.9s), 035/100 VUs, 557 complete and 0 interrupted iterations
default   [  41% ] 035/100 VUs  0m30.9s/1m15.0s

running (0m31.9s), 036/100 VUs, 590 complete and 0 interrupted iterations
default   [  43% ] 036/100 VUs  0m31.9s/1m15.0s

running (0m32.9s), 037/100 VUs, 626 complete and 0 interrupted iterations
default   [  44% ] 037/100 VUs  0m32.9s/1m15.0s

running (0m33.9s), 038/100 VUs, 663 complete and 0 interrupted iterations
default   [  45% ] 038/100 VUs  0m33.9s/1m15.0s

running (0m34.9s), 039/100 VUs, 701 complete and 0 interrupted iterations
default   [  47% ] 039/100 VUs  0m34.9s/1m15.0s

running (0m35.9s), 040/100 VUs, 740 complete and 0 interrupted iterations
default   [  48% ] 040/100 VUs  0m35.9s/1m15.0s

running (0m36.9s), 041/100 VUs, 780 complete and 0 interrupted iterations
default   [  49% ] 041/100 VUs  0m36.9s/1m15.0s

running (0m37.9s), 042/100 VUs, 821 complete and 0 interrupted iterations
default   [  51% ] 042/100 VUs  0m37.9s/1m15.0s

running (0m38.9s), 043/100 VUs, 863 complete and 0 interrupted iterations
default   [  52% ] 043/100 VUs  0m38.9s/1m15.0s

running (0m39.9s), 044/100 VUs, 906 complete and 0 interrupted iterations
default   [  53% ] 044/100 VUs  0m39.9s/1m15.0s

running (0m40.9s), 045/100 VUs, 950 complete and 0 interrupted iterations
default   [  55% ] 045/100 VUs  0m40.9s/1m15.0s

running (0m41.9s), 046/100 VUs, 994 complete and 0 interrupted iterations
default   [  56% ] 046/100 VUs  0m41.9s/1m15.0s

running (0m42.9s), 047/100 VUs, 1039 complete and 0 interrupted iterations
default   [  57% ] 047/100 VUs  0m42.9s/1m15.0s

running (0m43.9s), 048/100 VUs, 1086 complete and 0 interrupted iterations
default   [  59% ] 048/100 VUs  0m43.9s/1m15.0s

running (0m44.9s), 049/100 VUs, 1134 complete and 0 interrupted iterations
default   [  60% ] 049/100 VUs  0m44.9s/1m15.0s

running (0m45.9s), 053/100 VUs, 1183 complete and 0 interrupted iterations
default   [  61% ] 053/100 VUs  0m45.9s/1m15.0s

running (0m46.9s), 056/100 VUs, 1236 complete and 0 interrupted iterations
default   [  63% ] 056/100 VUs  0m46.9s/1m15.0s

running (0m47.9s), 059/100 VUs, 1292 complete and 0 interrupted iterations
default   [  64% ] 059/100 VUs  0m47.9s/1m15.0s

running (0m48.9s), 063/100 VUs, 1351 complete and 0 interrupted iterations
default   [  65% ] 063/100 VUs  0m48.9s/1m15.0s

running (0m49.9s), 066/100 VUs, 1413 complete and 0 interrupted iterations
default   [  67% ] 066/100 VUs  0m49.9s/1m15.0s

running (0m50.9s), 069/100 VUs, 1478 complete and 0 interrupted iterations
default   [  68% ] 069/100 VUs  0m50.9s/1m15.0s

running (0m51.9s), 073/100 VUs, 1547 complete and 0 interrupted iterations
default   [  69% ] 073/100 VUs  0m51.9s/1m15.0s

running (0m52.9s), 076/100 VUs, 1620 complete and 0 interrupted iterations
default   [  71% ] 076/100 VUs  0m52.9s/1m15.0s

running (0m53.9s), 079/100 VUs, 1695 complete and 0 interrupted iterations
default   [  72% ] 079/100 VUs  0m53.9s/1m15.0s

running (0m54.9s), 083/100 VUs, 1774 complete and 0 interrupted iterations
default   [  73% ] 083/100 VUs  0m54.9s/1m15.0s

running (0m55.9s), 086/100 VUs, 1857 complete and 0 interrupted iterations
default   [  75% ] 086/100 VUs  0m55.9s/1m15.0s

running (0m56.9s), 089/100 VUs, 1943 complete and 0 interrupted iterations
default   [  76% ] 089/100 VUs  0m56.9s/1m15.0s

running (0m57.9s), 093/100 VUs, 2032 complete and 0 interrupted iterations
default   [  77% ] 093/100 VUs  0m57.9s/1m15.0s

running (0m58.9s), 096/100 VUs, 2125 complete and 0 interrupted iterations
default   [  79% ] 096/100 VUs  0m58.9s/1m15.0s

running (0m59.9s), 099/100 VUs, 2220 complete and 0 interrupted iterations
default   [  80% ] 099/100 VUs  0m59.9s/1m15.0s

running (1m00.9s), 098/100 VUs, 2319 complete and 0 interrupted iterations
default   [  81% ] 098/100 VUs  1m00.9s/1m15.0s

running (1m01.9s), 092/100 VUs, 2413 complete and 0 interrupted iterations
default   [  83% ] 092/100 VUs  1m01.9s/1m15.0s

running (1m02.9s), 084/100 VUs, 2503 complete and 0 interrupted iterations
default   [  84% ] 084/100 VUs  1m02.9s/1m15.0s

running (1m03.9s), 077/100 VUs, 2586 complete and 0 interrupted iterations
default   [  85% ] 077/100 VUs  1m03.9s/1m15.0s

running (1m04.9s), 071/100 VUs, 2661 complete and 0 interrupted iterations
default   [  87% ] 071/100 VUs  1m04.9s/1m15.0s

running (1m05.9s), 065/100 VUs, 2732 complete and 0 interrupted iterations
default   [  88% ] 065/100 VUs  1m05.9s/1m15.0s

running (1m06.9s), 059/100 VUs, 2797 complete and 0 interrupted iterations
default   [  89% ] 059/100 VUs  1m06.9s/1m15.0s

running (1m07.9s), 051/100 VUs, 2856 complete and 0 interrupted iterations
default   [  91% ] 051/100 VUs  1m07.9s/1m15.0s

running (1m08.9s), 045/100 VUs, 2907 complete and 0 interrupted iterations
default   [  92% ] 045/100 VUs  1m08.9s/1m15.0s

running (1m09.9s), 038/100 VUs, 2952 complete and 0 interrupted iterations
default   [  93% ] 038/100 VUs  1m09.9s/1m15.0s

running (1m10.9s), 029/100 VUs, 2989 complete and 0 interrupted iterations
default   [  95% ] 029/100 VUs  1m10.9s/1m15.0s

running (1m11.9s), 022/100 VUs, 3018 complete and 0 interrupted iterations
default   [  96% ] 022/100 VUs  1m11.9s/1m15.0s

running (1m12.9s), 018/100 VUs, 3040 complete and 0 interrupted iterations
default   [  97% ] 018/100 VUs  1m12.9s/1m15.0s

running (1m13.9s), 011/100 VUs, 3057 complete and 0 interrupted iterations
default   [  99% ] 011/100 VUs  1m13.9s/1m15.0s

running (1m14.9s), 005/100 VUs, 3068 complete and 0 interrupted iterations
default   [ 100% ] 005/100 VUs  1m14.9s/1m15.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1000' p(95)=28.77ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 6146    81.02624/s
    checks_succeeded...: 100.00% 6146 out of 6146
    checks_failed......: 0.00%   0 out of 6146

    ✓ status 200
    ✓ has recommendations

    HTTP
    http_req_duration..............: avg=11.23ms min=4.22ms med=7.85ms max=95.5ms p(90)=21.49ms p(95)=28.77ms
      { expected_response:true }...: avg=11.23ms min=4.22ms med=7.85ms max=95.5ms p(90)=21.49ms p(95)=28.77ms
    http_req_failed................: 0.00%  0 out of 3073
    http_reqs......................: 3073   40.51312/s

    EXECUTION
    iteration_duration.............: avg=1.01s   min=1s     med=1s     max=1.12s  p(90)=1.02s   p(95)=1.03s  
    iterations.....................: 3073   40.51312/s
    vus............................: 5      min=2         max=99 
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 6.8 MB 89 kB/s
    data_sent......................: 575 kB 7.6 kB/s



running (1m15.9s), 000/100 VUs, 3073 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  1m15s